/*******************************************************************************
名称：key.c   
版本：V1.0_130314
功能：按键处理
说明：
*******************************************************************************/ 
#include "common.h"


//uint8 Key;		              //按键	
/*
//======================================================================
//读取按键值
//=================================================================
void read_key(void)		//50ms处理一次
{
 static uint8 key_state = 0,
							key_press_old;
  uint8 key_return = 0; 
	uint8 key_press;
  //---------------------------------------------------------------------------- 	
	key_press = !PORT_KEY;
  //----------------------------------------------------------------------------
  switch(key_state)
  {
  //----------------------------------------------------------------------------
  //按键初始态  
  //----------------------------------------------------------------------------
  case NO_KEY_STATE:                         		//按键初始态		
    if(key_press != 0)
    {
      key_press_old = key_press;    
      key_state     = KEY_STATE;               	//状态转换到按键判断确认			
    }		
    break;
  //----------------------------------------------------------------------------
  //按键判断确认
  //----------------------------------------------------------------------------
  case KEY_STATE:
    if(key_press == key_press_old)
    {
			if(key_press == 1)
			{
      	key_return = 1;
			}   
			key_state = KEY_KEY_STATE;               	//状态转换到按键单击或连跳判断确认     
    }
    else
    {
      key_state = NO_KEY_STATE;               	//按键已抬起，转换到按键初始态
    }
    break;  
	//---------------------------------------------------------------------------- 
  //按键KEY_3S判断确认
  //----------------------------------------------------------------------------
  case KEY_KEY_STATE:
    if(key_press == KEY_NO_VALUE)
    {
      key_state = NO_KEY_STATE;
    }
    break;		
  default:
    break;
  } 
	Key = key_return;
}
//==============================================================================
//控制器正常状态按键处理
//==============================================================================
void key_deal(void)
{  	  
	if(1 == Flag_Data.Normal_Work)
	{
		if(0 == Flag_Data.Lc_Tem_Err && 0 == Flag_Data.Ld_Tem_Err && 0 == Flag_Data.Ld_Hs_Tem_Err 
		  && 0 == Flag_Data.Hs_Err && 0 == Flag_Data.Fan_Err && 0 == Flag_Data.Comm_Err)		//
		{	
			if(1 == Flag_Data.Key_Enable)
			{
				Flag_Data.Key_Enable = 0;
				read_key();			
				switch(Key)
				{
				case 1:				
					if(++Test_Mode_Data >= 3)
					{
						Test_Mode_Data = 3;
					}				
					break;
				default:
					break;
				}			
			}
		}
		else
		{
			if(Test_Mode_Data > 0)
			{
				Test_Mode_Data = 3;
			}
		}
	}
}
*/