/*******************************************************************************
名称：time0_isr.c   
版本：V1.0_090205
功能：(mega48V)
说明：time0定时中断
*******************************************************************************/
#include "common.h"
//------------------------------------------------------------------------------
//T1工作在定时方式
//定时器采用1MHz系统时钟作为定时时钟
//每记1个数（2ms）溢出1次
//------------------------------------------------------------------------------


uint8 Time_1ms_Counter   = 0;       //1ms计数变
uint8 Time_50ms_Counter  = 0;				//50ms
uint16 Time_1s_Counter = 0;       //100ms计数变量


uint8 No_Normal_Time_Counter; 			//非常规时间计时

uint8 Light_Duty;
uint8 Time_Fan_Door_Counter;
//==============================================================================
//时间处理
//==============================================================================
void time_deal(void)
{	
	
	if(++Time_Fan_Door_Counter >= 3)
	{
		Time_Fan_Door_Counter      = 0;		
		Flag_Data.Fan_Door_Clock = 1;			//通信发送使能	
	}
	if(++Time_1ms_Counter >= 50)
	{
		Time_1ms_Counter  = 0;
        Flag_Data.Light_Enable = 1;	
        //------------------------------------------------------------------------
        //100ms基准计时
        //-------------------------------------------------------------------------
        if(++Time_50ms_Counter >= 2)        //100ms		
        {
            Time_50ms_Counter = 0;	
            Flag_Data.Door_Key_Clock = 1;		
            //--------------------------------------------
            //正常工作
				//--------------------------------------------										
            if(No_Normal_Time_Counter < 15)
            {
                No_Normal_Time_Counter++; 
            }
            else  
            {
                Flag_Data.Normal_Work = 1;
            }	          
        }		
    }
      //----------------------------------------------------------------------
    //1s基准计时
    //-----------------------------------------------------------------------
    if(++Time_1s_Counter >= 961)      //1ms
    {
        Time_1s_Counter = 0;	
        Flag_Data.Control_Enable = 1;				//控制使能						
        Flag_Data.Comm_Enable = 1;	
    }			
}



